UVUtils.UV.unit
Make this a unit vector or return ERR_NULL_VECTOR if the vector is nearly zero.

UVUtils.UV.#ctor(System.Double,System.Double)
construct from components

UVUtils.UV.basisV
returns a unit vector in the V-direction (0, 1)

UVUtils.UV.basisU
returns a unit vector in the U-direction (1, 0)

UVUtils.UV.zero
returns (0, 0)

UVUtils.UV
'UVUtils::UV' is a class that represents a 2d vector or a 2d point.
Remarks:
By default UVUtils::UV is initialized to {0.0, 0.0}.